Revit 2021.1 API
ReinforcementSettings.GetReinforcementSettings Method
 Obtains the ReinforcementSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2013
Syntax
C#
public static ReinforcementSettings GetReinforcementSettings(
	Document cda
)
Visual Basic
Public Shared Function GetReinforcementSettings ( _
	cda As Document _
) As ReinforcementSettings
Visual C++
public:
static ReinforcementSettings^ GetReinforcementSettings(
	Document^ cda
)
Parameters
cda
Type: Autodesk.Revit.DB.Document
 A project document.
Return Value
 The ReinforcementSettings object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  cda is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace